app/controllers/newtests_controller.rb

SELECT "newtests".* FROM "newtests"
---
  def index
    @newtests = Newtest.all

SELECT "newtests".* FROM "newtests" WHERE "newtests"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @newtest = Newtest.find(params[:id])

SELECT "newtests".* FROM "newtests" WHERE "newtests"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @newtest = Newtest.find(params[:id])

INSERT INTO "newtests" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 13 Dec 2012 04:33:43 UTC +00:00], ["name", nil], ["updated_at", Thu, 13 Dec 2012 04:33:43 UTC +00:00]]
---
  def create
    @newtest = Newtest.new(params[:newtest])

    respond_to do |format|
      if @newtest.save

SELECT "newtests".* FROM "newtests" WHERE "newtests"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @newtest = Newtest.find(params[:id])

SELECT "newtests".* FROM "newtests" WHERE "newtests"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "newtests" WHERE "newtests"."id" = ?  [["id", 1]]
---
  def destroy
    @newtest = Newtest.find(params[:id])
    @newtest.destroy